# 算术运算符： + - * / // % **
# print("10 + 4= ", 10 + 4)  # 加
# print("10 - 4= ", 10 - 4)  # 减
# print("10 * 4 = ", 10 * 4) # 乘
# print("10 / 4= ", 10 / 4) # 除 - 2.5
# print("10 // 4 = ", 10 // 4)# 整除(结果为整数）-2
# print("10 % 4 = ", 10 % 4) # 取余/求模 - 2
# print("10 ** 4 = ", 10 ** 4) # 幂指数，10的4次方- 10000

# 算术运算符的优先级 ** --> * --> / --> // --> % --> + -
# 案例1：要求输入两个数x与y，分别输出x+y的结果和x-y的结果
# x = float(input("请输入x的值： "))
# y = float(input("请输入y的值： "))
# print("x + y = ", x + y)
# print("x - y = ", x - y)

# 赋值运算符： += -= *= /= //= %= **=
# num = 55
# num += 10
# print(num)
# num -= 10
# print(num)
# num *= 10
# print(num)
#
# #比较运算符
# a = 1
# b = 2
#
# print(a == b)
# print(a != b)
# print(a < b)
# print(a <= b)
# print(a >= b)
# print(a is b)

#逻辑运算符
# 什么是逻辑运算符？
# 逻辑运算符用于连接多个布尔表达式（True或False），并返回最终的一个
# 布尔值
# 有哪些逻辑运算符？
# and(并且，同时成立）
# or（或者，满足其一)
# not（非，取反操作）
#需求1：键盘输入一个整数，判断这个数字是否在10-20之间。
num = int(input("请输入一个整数:"))
print(f"{num}在10-20之间：", 10 <= num and num <= 20)
# print(f"{num}在10-20之间：", 10 <= num <= 20)
#需求2：键盘输入一个整数，判断这个数字是否不在10-20之间。
num = int(input("请输入一个整数:"))
print(f"{num}不在10-20之间：", 10 >= num or num>= 20)